// 1. Поиск элементов - получение сылки на элемент что бы с ним работать 

// 2. свойства - Любой Тег это Объект и у этого Объекта есть свойства которые мы можем изменять!

// 3. Классы - добавить/удалить/заменить/проверить и т.д

// 4. Свойства «навигации» по DOM-узлам - различные свойства для выбора элементов

// 5. Создание элементов - создание/вставка элементов

// 6. export/import - типа берем код с другова места

// 7. Свойства innerHTML и insertAdjacentHTML() - 1 - что-то очистить или записать не изменяя старое 2 - добавлять новое

// 8. Сулушатели событий - вешаем на что-то слушателя, когда происходит событие браузер присылаем нам объект события с параметрами

// 9. Событие submit (Событие ФОРМЫ а не ее элементов) - сбор начений элементов формы 

// 10. Паттерн «Объект ссылок», события focus и blur, input и change, Чекбоксы и свойство checked

// 11. События клавиатуры - keypress - композитное, keydown - отжимается в низ, keyup - отжимвется вверх и другие

// 12. События мыши - mouseenter и mouseleave, mouseover и mouseout, mousemove